app/controllers/pages_controller.rb

SELECT "stories".* FROM "stories"
---
  def show
  @stories = Story.all