app/controllers/stories_controller.rb

  def create
    if !current_user
      redirect_to '/login'
    else
      story = Story.new
      story.title = params[:title]
      story.story_img = params[:img_file]
      if story.save
---
INSERT INTO "stories" ("title", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"