app/controllers/users_controller.rb

  def create
    user = User.new
    user.username = params[:username]
    user.email = params[:email]
    user.image_url = params[:image_url]
    user.password = params[:password]
    user.banana = 20
    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "banana", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"